🚀&nbsp; env0 had composed a PR Plan for environment [Triggered Env Plugin / Triggering-env1 ](https://app.env0.com/p/8ecd5554-fae1-439a-a789-33f005657861/environments/8ff01480-fa6d-4a4d-8d8e-82f7ae8412e2):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:


  # random_string.random must be replaced
-/+ resource "random_string" "random" {
!       id          = "F8dST" -> (known after apply)
!       result      = "F8dST" -> (known after apply)
!       special     = false -> true # forces replacement
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   random_string = "F8dST" -> (known after apply)
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/8ecd5554-fae1-439a-a789-33f005657861/environments/8ff01480-fa6d-4a4d-8d8e-82f7ae8412e2/deployments/76b9029e-d9bd-4cca-9e86-93d9cf755ec1)